In [2]:
# Data Filtering
import pandas as pd

df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5", "C6", "C7", "C8", "C9", "C10"],
    "item_bought": [10, 15, 20, 35, 4, 10, 2, 0, 9, 15],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bali", "Jakarta", "Jakarta", "Bandung", "Bogor", "Jakarta"]
})

In [7]:
# Loc
df.loc[0, 'cust_id']

'C1'

In [8]:
df.loc[5, 'city']

'Jakarta'

In [9]:
df.loc[3, 'item_bought']

np.int64(35)

In [10]:
df.loc[1:4, 'city']

1      Jakarta
2        Bogor
3    Tangerang
4         Bali
Name: city, dtype: object

In [11]:
df.loc[0:3, ["city", "cust_id"]]

        city cust_id
0    Bandung      C1
1    Jakarta      C2
2      Bogor      C3
3  Tangerang      C4

In [13]:
#iloc
df.iloc[1:3, 0:3]

  cust_id  item_bought     city
1      C2           15  Jakarta
2      C3           20    Bogor

In [16]:
# Filtering with criteria
df[df["city"] == "Bogor"]

  cust_id  item_bought   city
2      C3           20  Bogor
8      C9            9  Bogor

In [22]:
df[df['item_bought'] > 10]

  cust_id  item_bought       city
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
9     C10           15    Jakarta

In [24]:
# Filtering with several criterias
# df item bought more than 10 and city is not bogor
df[(df['item_bought']) & ~(df['city'] == 'Bogor')]

  cust_id  item_bought       city
1      C2           15    Jakarta
3      C4           35  Tangerang
9     C10           15    Jakarta

In [27]:
df[(df['city'] == 'Bogor') | (df['city'] == 'Jakarta')]

  cust_id  item_bought     city
1      C2           15  Jakarta
2      C3           20    Bogor
5      C6           10  Jakarta
6      C7            2  Jakarta
8      C9            9    Bogor
9     C10           15  Jakarta

In [29]:
# Filter with isin operation
list_cities = ["Jakarta", "Depok", "Tangerang"]
df[df['city'].isin(list_cities)]

  cust_id  item_bought       city
1      C2           15    Jakarta
3      C4           35  Tangerang
5      C6           10    Jakarta
6      C7            2    Jakarta
9     C10           15    Jakarta

In [30]:
list_custs = ['C1', 'C5', 'C7']
df[df['cust_id'].isin(list_custs)]

  cust_id  item_bought     city
0      C1           10  Bandung
4      C5            4     Bali
6      C7            2  Jakarta